layer{
  name: "label"
  top: "label"
  type: "Parameter"
  parameter_param2{
    d: 21
    n: 1
  }
}

layer {
  name: "arg-inner"
  top: "arg-inner"
  type: "Parameter"
  parameter_param2{
    d: 121381
    n: 1
  }
}

layer{
  name: "value-frame"
  top: "value-frame"
  type: "Parameter"
  parameter_param2{
    d: 504
    n: 1
  }
}
layer {
  name: "slicer"
  type: "Slice"
  bottom:"arg-inner"
  top : "value-adjusting-Tool"
  top : "value-adjusting-Item"
  top : "value-adjusting-Feature"
  top : "value-adjusting-Place"
  top : "value-adjusting-Agent"
  top : "value-admiring-Place"
  top : "value-admiring-Admired"
  top : "value-admiring-Agent"
  top : "value-ailing-Cause"
  top : "value-ailing-Place"
  top : "value-ailing-Victim"
  top : "value-ailing-VictimPart"
  top : "value-aiming-Place"
  top : "value-aiming-Item"
  top : "value-aiming-Agent"
  top : "value-aiming-Target"
  top : "value-applauding-Place"
  top : "value-applauding-Addressee"
  top : "value-applauding-Agent"
  top : "value-applying-Tool"
  top : "value-applying-Destination"
  top : "value-applying-Place"
  top : "value-applying-Substance"
  top : "value-applying-Agent"
  top : "value-apprehending-Victim"
  top : "value-apprehending-Place"
  top : "value-apprehending-Agent"
  top : "value-arching-Place"
  top : "value-arching-BODYPART"
  top : "value-arching-Agent"
  top : "value-arranging-Tool"
  top : "value-arranging-Item"
  top : "value-arranging-Agent"
  top : "value-arranging-Place"
  top : "value-arresting-Suspect"
  top : "value-arresting-Place"
  top : "value-arresting-Agent"
  top : "value-ascending-Agent"
  top : "value-ascending-Place"
  top : "value-asking-Place"
  top : "value-asking-Addressee"
  top : "value-asking-Agent"
  top : "value-assembling-Tool"
  top : "value-assembling-Component"
  top : "value-assembling-Place"
  top : "value-assembling-GoalItem"
  top : "value-assembling-Agent"
  top : "value-attaching-Destination"
  top : "value-attaching-Tool"
  top : "value-attaching-Item"
  top : "value-attaching-Agent"
  top : "value-attaching-Glue"
  top : "value-attaching-Place"
  top : "value-attacking-Place"
  top : "value-attacking-Weapon"
  top : "value-attacking-Agent"
  top : "value-attacking-Victim"
  top : "value-autographing-Place"
  top : "value-autographing-Item"
  top : "value-autographing-Receiver"
  top : "value-autographing-Agent"
  top : "value-baking-Place"
  top : "value-baking-Food"
  top : "value-baking-Agent"
  top : "value-baking-FoodContainer"
  top : "value-baking-HeatSource"
  top : "value-ballooning-Agent"
  top : "value-ballooning-Place"
  top : "value-bandaging-VICTIM"
  top : "value-bandaging-Place"
  top : "value-bandaging-Agent"
  top : "value-baptizing-BAPTIZED"
  top : "value-baptizing-Place"
  top : "value-baptizing-Agent"
  top : "value-barbecuing-Place"
  top : "value-barbecuing-Food"
  top : "value-barbecuing-Agent"
  top : "value-bathing-Substance"
  top : "value-bathing-CoAgent"
  top : "value-bathing-Tool"
  top : "value-bathing-Place"
  top : "value-bathing-Agent"
  top : "value-begging-Place"
  top : "value-begging-ITEM"
  top : "value-begging-Agent"
  top : "value-begging-GIVER"
  top : "value-betting-Agent"
  top : "value-betting-Place"
  top : "value-biking-Agent"
  top : "value-biking-Place"
  top : "value-biting-Place"
  top : "value-biting-Item"
  top : "value-biting-Agent"
  top : "value-blocking-Tool"
  top : "value-blocking-Blocker"
  top : "value-blocking-Blocked"
  top : "value-blocking-Place"
  top : "value-blossoming-Agent"
  top : "value-blossoming-Place"
  top : "value-boarding-Agent"
  top : "value-boarding-Place"
  top : "value-boarding-Vehicle"
  top : "value-boating-Boaters"
  top : "value-boating-Place"
  top : "value-boating-Vehicle"
  top : "value-bothering-Victim"
  top : "value-bothering-Action"
  top : "value-bothering-Agent"
  top : "value-bouncing-Place"
  top : "value-bouncing-Item"
  top : "value-bouncing-Agent"
  top : "value-bouncing-Surface"
  top : "value-bowing-Agent"
  top : "value-bowing-Place"
  top : "value-braiding-Place"
  top : "value-braiding-Item"
  top : "value-braiding-Agent"
  top : "value-branching-Brancher"
  top : "value-branching-Place"
  top : "value-brawling-Agent"
  top : "value-brawling-Place"
  top : "value-breaking-Tool"
  top : "value-breaking-Item"
  top : "value-breaking-Agent"
  top : "value-breaking-Against"
  top : "value-brewing-Target"
  top : "value-brewing-Place"
  top : "value-brewing-Agent"
  top : "value-browsing-GoalItem"
  top : "value-browsing-Place"
  top : "value-browsing-Agent"
  top : "value-brushing-Substance"
  top : "value-brushing-TOOL"
  top : "value-brushing-Target"
  top : "value-brushing-Place"
  top : "value-brushing-Agent"
  top : "value-bubbling-Agent"
  top : "value-bubbling-Place"
  top : "value-buckling-Fastener"
  top : "value-buckling-Item"
  top : "value-buckling-Place"
  top : "value-buckling-Container"
  top : "value-buckling-Agent"
  top : "value-building-Tool"
  top : "value-building-Place"
  top : "value-building-Components"
  top : "value-building-GoalItem"
  top : "value-building-Agent"
  top : "value-bulldozing-Place"
  top : "value-bulldozing-Object"
  top : "value-bulldozing-Agent"
  top : "value-burning-Target"
  top : "value-burning-Place"
  top : "value-burning-Agent"
  top : "value-burying-Tool"
  top : "value-burying-Item"
  top : "value-burying-Place"
  top : "value-burying-Destination"
  top : "value-burying-Agent"
  top : "value-buttering-Tool"
  top : "value-buttering-Item"
  top : "value-buttering-Agent"
  top : "value-buttering-Place"
  top : "value-butting-Target"
  top : "value-butting-Place"
  top : "value-butting-Agent"
  top : "value-buttoning-Place"
  top : "value-buttoning-Item"
  top : "value-buttoning-Agent"
  top : "value-buying-Place"
  top : "value-buying-Goods"
  top : "value-buying-Agent"
  top : "value-buying-Payment"
  top : "value-buying-Seller"
  top : "value-calling-Place"
  top : "value-calling-Tool"
  top : "value-calling-Agent"
  top : "value-calming-Experiencer"
  top : "value-calming-Place"
  top : "value-calming-Agent"
  top : "value-camouflaging-HidingItem"
  top : "value-camouflaging-Place"
  top : "value-camouflaging-Agent"
  top : "value-camping-Place"
  top : "value-camping-Shelter"
  top : "value-camping-Agent"
  top : "value-caressing-RecipientPart"
  top : "value-caressing-Place"
  top : "value-caressing-Agent"
  top : "value-caressing-Recipient"
  top : "value-carrying-Place"
  top : "value-carrying-Item"
  top : "value-carrying-AgentPart"
  top : "value-carrying-Agent"
  top : "value-carting-Tool"
  top : "value-carting-Item"
  top : "value-carting-Agent"
  top : "value-carting-Place"
  top : "value-carving-SUBSTANCE"
  top : "value-carving-Tool"
  top : "value-carving-Agent"
  top : "value-carving-Place"
  top : "value-catching-CaughtItem"
  top : "value-catching-Tool"
  top : "value-catching-Agent"
  top : "value-catching-Place"
  top : "value-celebrating-Place"
  top : "value-celebrating-Occasion"
  top : "value-celebrating-Agent"
  top : "value-chasing-Chasee"
  top : "value-chasing-Place"
  top : "value-chasing-Agent"
  top : "value-checking-Tool"
  top : "value-checking-Place"
  top : "value-checking-Aspect"
  top : "value-checking-Patient"
  top : "value-checking-Agent"
  top : "value-cheering-Agent"
  top : "value-cheering-Place"
  top : "value-cheerleading-Place"
  top : "value-cheerleading-Supported"
  top : "value-cheerleading-Agent"
  top : "value-chewing-Place"
  top : "value-chewing-Item"
  top : "value-chewing-Agent"
  top : "value-chiseling-Place"
  top : "value-chiseling-Item"
  top : "value-chiseling-Agent"
  top : "value-chopping-Tool"
  top : "value-chopping-Item"
  top : "value-chopping-Agent"
  top : "value-chopping-Place"
  top : "value-circling-Center"
  top : "value-circling-Place"
  top : "value-circling-Agent"
  top : "value-clapping-Place"
  top : "value-clapping-AgentPart"
  top : "value-clapping-Agent"
  top : "value-clawing-Victim"
  top : "value-clawing-Place"
  top : "value-clawing-Agent"
  top : "value-cleaning-Tool"
  top : "value-cleaning-Source"
  top : "value-cleaning-Agent"
  top : "value-cleaning-Place"
  top : "value-clearing-Tool"
  top : "value-clearing-Item"
  top : "value-clearing-Agent"
  top : "value-clearing-Place"
  top : "value-clearing-Source"
  top : "value-clenching-Place"
  top : "value-clenching-Item"
  top : "value-clenching-AgentPart"
  top : "value-clenching-Agent"
  top : "value-climbing-Obstacle"
  top : "value-climbing-Tool"
  top : "value-climbing-Agent"
  top : "value-climbing-Place"
  top : "value-clinging-Place"
  top : "value-clinging-ClungTo"
  top : "value-clinging-Agent"
  top : "value-clipping-Tool"
  top : "value-clipping-Item"
  top : "value-clipping-Agent"
  top : "value-clipping-Place"
  top : "value-clipping-Source"
  top : "value-coaching-Place"
  top : "value-coaching-Skill"
  top : "value-coaching-Agent"
  top : "value-coaching-Student"
  top : "value-colliding-Place"
  top : "value-colliding-Item"
  top : "value-colliding-Agent"
  top : "value-coloring-Tool"
  top : "value-coloring-Item"
  top : "value-coloring-Agent"
  top : "value-coloring-Place"
  top : "value-combing-Place"
  top : "value-combing-Tool"
  top : "value-combing-Agent"
  top : "value-combing-Target"
  top : "value-communicating-Adressee"
  top : "value-communicating-Place"
  top : "value-communicating-Agent"
  top : "value-commuting-Place"
  top : "value-commuting-Traveler"
  top : "value-commuting-Vehicle"
  top : "value-competing-Competition"
  top : "value-competing-Place"
  top : "value-competing-Agent"
  top : "value-complaining-Place"
  top : "value-complaining-Listener"
  top : "value-complaining-Agent"
  top : "value-confronting-Confronted"
  top : "value-confronting-Place"
  top : "value-confronting-Agent"
  top : "value-congregating-Place"
  top : "value-congregating-Individuals"
  top : "value-constructing-Tool"
  top : "value-constructing-Place"
  top : "value-constructing-CreatedItem"
  top : "value-constructing-Components"
  top : "value-constructing-Agent"
  top : "value-cooking-Food"
  top : "value-cooking-Container"
  top : "value-cooking-Agent"
  top : "value-cooking-Tool"
  top : "value-cooking-HeatSource"
  top : "value-cooking-Place"
  top : "value-coughing-Agent"
  top : "value-coughing-Place"
  top : "value-counting-ItemType"
  top : "value-counting-Place"
  top : "value-counting-Agent"
  top : "value-covering-Place"
  top : "value-covering-Item"
  top : "value-covering-Agent"
  top : "value-covering-Cover"
  top : "value-crafting-Place"
  top : "value-crafting-Instrument"
  top : "value-crafting-Created"
  top : "value-crafting-Agent"
  top : "value-cramming-Theme"
  top : "value-cramming-Place"
  top : "value-cramming-Agent"
  top : "value-cramming-Container"
  top : "value-crashing-Place"
  top : "value-crashing-Item"
  top : "value-crashing-Agent"
  top : "value-crashing-Against"
  top : "value-crawling-Agent"
  top : "value-crawling-Place"
  top : "value-cresting-Agent"
  top : "value-cresting-Place"
  top : "value-crouching-Agent"
  top : "value-crouching-Place"
  top : "value-crowning-Crown"
  top : "value-crowning-Place"
  top : "value-crowning-Agent"
  top : "value-crowning-CrownedEntity"
  top : "value-crushing-Tool"
  top : "value-crushing-Place"
  top : "value-crushing-Agent"
  top : "value-crushing-CrushedItem"
  top : "value-crying-Agent"
  top : "value-crying-Place"
  top : "value-curling-Place"
  top : "value-curling-Tool"
  top : "value-curling-Agent"
  top : "value-curling-Target"
  top : "value-curtsying-Agent"
  top : "value-curtsying-Place"
  top : "value-dancing-Agent"
  top : "value-dancing-Place"
  top : "value-decomposing-Decomposer"
  top : "value-decomposing-Place"
  top : "value-decorating-Decorated"
  top : "value-decorating-Item"
  top : "value-decorating-Agent"
  top : "value-decorating-Place"
  top : "value-deflecting-Place"
  top : "value-deflecting-Destination"
  top : "value-deflecting-Agent"
  top : "value-deflecting-DeflectedItem"
  top : "value-descending-tool"
  top : "value-descending-source"
  top : "value-descending-Agent"
  top : "value-descending-Place"
  top : "value-destroying-Tool"
  top : "value-destroying-DestroyedItem"
  top : "value-destroying-Agent"
  top : "value-destroying-Place"
  top : "value-detaining-Victim"
  top : "value-detaining-Place"
  top : "value-detaining-Agent"
  top : "value-dialing-Place"
  top : "value-dialing-Item"
  top : "value-dialing-Agent"
  top : "value-dining-Place"
  top : "value-dining-Food"
  top : "value-dining-Agent"
  top : "value-dipping-Substance"
  top : "value-dipping-Item"
  top : "value-dipping-Agent"
  top : "value-dipping-Place"
  top : "value-disciplining-Place"
  top : "value-disciplining-Tool"
  top : "value-disciplining-Agent"
  top : "value-disciplining-Victim"
  top : "value-discussing-Agents"
  top : "value-discussing-Place"
  top : "value-disembarking-Agent"
  top : "value-disembarking-Place"
  top : "value-disembarking-Vehicle"
  top : "value-displaying-Place"
  top : "value-displaying-Item"
  top : "value-displaying-Agent"
  top : "value-displaying-Target"
  top : "value-dissecting-Tool"
  top : "value-dissecting-Item"
  top : "value-dissecting-Agent"
  top : "value-dissecting-Place"
  top : "value-distracting-Victim"
  top : "value-distracting-Place"
  top : "value-distracting-Agent"
  top : "value-distributing-Tool"
  top : "value-distributing-Place"
  top : "value-distributing-Recipients"
  top : "value-distributing-Distributed"
  top : "value-distributing-Agent"
  top : "value-diving-Agent"
  top : "value-diving-Place"
  top : "value-docking-Place"
  top : "value-docking-Connector"
  top : "value-docking-Vehicle"
  top : "value-docking-Agent"
  top : "value-dousing-Place"
  top : "value-dousing-Undergoer"
  top : "value-dousing-Agent"
  top : "value-dousing-Liquid"
  top : "value-dragging-Tool"
  top : "value-dragging-Item"
  top : "value-dragging-Place"
  top : "value-dragging-Contact"
  top : "value-dragging-Agent"
  top : "value-drawing-Place"
  top : "value-drawing-Tool"
  top : "value-drawing-Agent"
  top : "value-drawing-Reference"
  top : "value-drenching-Tool"
  top : "value-drenching-DrenchedItem"
  top : "value-drenching-Liquid"
  top : "value-drenching-Place"
  top : "value-drenching-Agent"
  top : "value-drinking-Container"
  top : "value-drinking-Place"
  top : "value-drinking-Agent"
  top : "value-drinking-Liquid"
  top : "value-dripping-Destination"
  top : "value-dripping-Source"
  top : "value-dripping-Fluid"
  top : "value-dripping-Place"
  top : "value-dripping-Agent"
  top : "value-driving-Place"
  top : "value-driving-Item"
  top : "value-driving-Agent"
  top : "value-drooling-End"
  top : "value-drooling-Place"
  top : "value-drooling-Agent"
  top : "value-dropping-Place"
  top : "value-dropping-Item"
  top : "value-dropping-Agent"
  top : "value-dropping-End"
  top : "value-dropping-Start"
  top : "value-drumming-Tool"
  top : "value-drumming-ITEM"
  top : "value-drumming-Agent"
  top : "value-drumming-Place"
  top : "value-drying-Tool"
  top : "value-drying-Item"
  top : "value-drying-Agent"
  top : "value-drying-Place"
  top : "value-ducking-Place"
  top : "value-ducking-Blow"
  top : "value-ducking-Agent"
  top : "value-dusting-Tool"
  top : "value-dusting-Source"
  top : "value-dusting-Agent"
  top : "value-dusting-Place"
  top : "value-dyeing-Material"
  top : "value-dyeing-Dye"
  top : "value-dyeing-Agent"
  top : "value-dyeing-Place"
  top : "value-eating-Place"
  top : "value-eating-Food"
  top : "value-eating-Container"
  top : "value-eating-Tool"
  top : "value-eating-Agent"
  top : "value-educating-Teacher"
  top : "value-educating-Place"
  top : "value-educating-Subject"
  top : "value-educating-Student"
  top : "value-ejecting-Destination"
  top : "value-ejecting-Item"
  top : "value-ejecting-Agent"
  top : "value-ejecting-Place"
  top : "value-ejecting-Source"
  top : "value-embracing-Place"
  top : "value-embracing-Coagent"
  top : "value-embracing-Agent"
  top : "value-emerging-Destination"
  top : "value-emerging-Source"
  top : "value-emerging-Agent"
  top : "value-emerging-Place"
  top : "value-emptying-Tool"
  top : "value-emptying-Container"
  top : "value-emptying-Agent"
  top : "value-emptying-Destination"
  top : "value-emptying-Place"
  top : "value-emptying-Item"
  top : "value-encouraging-Agent"
  top : "value-encouraging-Place"
  top : "value-encouraging-Reciever"
  top : "value-erasing-Source"
  top : "value-erasing-Erased"
  top : "value-erasing-Agent"
  top : "value-erasing-Place"
  top : "value-erupting-Place"
  top : "value-erupting-Substance"
  top : "value-erupting-Agent"
  top : "value-examining-Tool"
  top : "value-examining-Item"
  top : "value-examining-Agent"
  top : "value-examining-Place"
  top : "value-exercising-Place"
  top : "value-exercising-AgentPart"
  top : "value-exercising-Agent"
  top : "value-exterminating-Place"
  top : "value-exterminating-Instrument"
  top : "value-exterminating-Agent"
  top : "value-extinguishing-Tool"
  top : "value-extinguishing-Item"
  top : "value-extinguishing-Agent"
  top : "value-extinguishing-Place"
  top : "value-falling-Place"
  top : "value-falling-Source"
  top : "value-falling-Agent"
  top : "value-falling-Goal"
  top : "value-farming-Tool"
  top : "value-farming-Item"
  top : "value-farming-Place"
  top : "value-farming-Ground"
  top : "value-farming-Farmer"
  top : "value-fastening-Destination"
  top : "value-fastening-Tool"
  top : "value-fastening-Connector"
  top : "value-fastening-Agent"
  top : "value-fastening-Place"
  top : "value-fastening-Item"
  top : "value-feeding-Source"
  top : "value-feeding-Food"
  top : "value-feeding-Place"
  top : "value-feeding-Eater"
  top : "value-feeding-Agent"
  top : "value-fetching-Destination"
  top : "value-fetching-Item"
  top : "value-fetching-Agent"
  top : "value-fetching-Place"
  top : "value-fetching-Source"
  top : "value-filling-Destination"
  top : "value-filling-Item"
  top : "value-filling-Agent"
  top : "value-filling-Place"
  top : "value-filling-Source"
  top : "value-filming-Performer"
  top : "value-filming-Tool"
  top : "value-filming-Agent"
  top : "value-filming-Place"
  top : "value-fishing-Tool"
  top : "value-fishing-SOURCE"
  top : "value-fishing-Agent"
  top : "value-fishing-Place"
  top : "value-fixing-Tool"
  top : "value-fixing-Place"
  top : "value-fixing-ObjectPart"
  top : "value-fixing-Object"
  top : "value-fixing-Agent"
  top : "value-flaming-Agent"
  top : "value-flaming-Place"
  top : "value-flapping-Place"
  top : "value-flapping-BodyPart"
  top : "value-flapping-Agent"
  top : "value-flexing-Addressee"
  top : "value-flexing-AgentPart"
  top : "value-flexing-Agent"
  top : "value-flexing-Place"
  top : "value-flicking-Place"
  top : "value-flicking-AgentPart"
  top : "value-flicking-ObjectPart"
  top : "value-flicking-Object"
  top : "value-flicking-Agent"
  top : "value-flinging-Tool"
  top : "value-flinging-Item"
  top : "value-flinging-Goal"
  top : "value-flinging-Place"
  top : "value-flinging-Agent"
  top : "value-flipping-Place"
  top : "value-flipping-Tool"
  top : "value-flipping-Flipped"
  top : "value-flipping-Agent"
  top : "value-floating-Medium"
  top : "value-floating-Tool"
  top : "value-floating-Agent"
  top : "value-floating-Place"
  top : "value-flossing-Place"
  top : "value-flossing-CoAgent"
  top : "value-flossing-Agent"
  top : "value-folding-Shape"
  top : "value-folding-Cloth"
  top : "value-folding-Agent"
  top : "value-folding-Place"
  top : "value-foraging-Place"
  top : "value-foraging-Item"
  top : "value-foraging-Agent"
  top : "value-fording-Place"
  top : "value-fording-Tool"
  top : "value-fording-Agent"
  top : "value-frisking-Victim"
  top : "value-frisking-Place"
  top : "value-frisking-Agent"
  top : "value-frowning-Agent"
  top : "value-frowning-Place"
  top : "value-frying-Place"
  top : "value-frying-Food"
  top : "value-frying-Agent"
  top : "value-frying-Container"
  top : "value-fueling-Tool"
  top : "value-fueling-Place"
  top : "value-fueling-Agent"
  top : "value-fueling-Recipient"
  top : "value-gambling-Place"
  top : "value-gambling-Stake"
  top : "value-gambling-Agent"
  top : "value-gardening-Place"
  top : "value-gardening-Tool"
  top : "value-gardening-Agent"
  top : "value-gasping-Agent"
  top : "value-gasping-Place"
  top : "value-gathering-Gatherers"
  top : "value-gathering-Place"
  top : "value-giggling-Target"
  top : "value-giggling-Place"
  top : "value-giggling-Agent"
  top : "value-giving-Place"
  top : "value-giving-Item"
  top : "value-giving-Agent"
  top : "value-giving-Recipient"
  top : "value-glaring-Perceiver"
  top : "value-glaring-Place"
  top : "value-glaring-Agent"
  top : "value-glowing-Agent"
  top : "value-glowing-Place"
  top : "value-gluing-Item"
  top : "value-gluing-Connector"
  top : "value-gluing-Goal"
  top : "value-gluing-Place"
  top : "value-gluing-Agent"
  top : "value-gnawing-Place"
  top : "value-gnawing-Item"
  top : "value-gnawing-Agent"
  top : "value-grieving-Agent"
  top : "value-grieving-Place"
  top : "value-grilling-Place"
  top : "value-grilling-Food"
  top : "value-grilling-Agent"
  top : "value-grimacing-Cause"
  top : "value-grimacing-Place"
  top : "value-grimacing-Agent"
  top : "value-grinding-Tool"
  top : "value-grinding-Item"
  top : "value-grinding-Surface"
  top : "value-grinding-Place"
  top : "value-grinding-Agent"
  top : "value-grinning-Agent"
  top : "value-grinning-Place"
  top : "value-guarding-Weapon"
  top : "value-guarding-Item"
  top : "value-guarding-Agent"
  top : "value-guarding-Place"
  top : "value-handcuffing-Victim"
  top : "value-handcuffing-Place"
  top : "value-handcuffing-Agent"
  top : "value-hanging-Scaffold"
  top : "value-hanging-Item"
  top : "value-hanging-Agent"
  top : "value-hanging-Place"
  top : "value-harvesting-Tool"
  top : "value-harvesting-HarvestedItem"
  top : "value-harvesting-Agent"
  top : "value-harvesting-Place"
  top : "value-harvesting-Ground"
  top : "value-hauling-Tool"
  top : "value-hauling-Item"
  top : "value-hauling-Place"
  top : "value-hauling-Carrier"
  top : "value-heaving-Tool"
  top : "value-heaving-HeavedItem"
  top : "value-heaving-Agent"
  top : "value-heaving-Place"
  top : "value-helping-Place"
  top : "value-helping-Tool"
  top : "value-helping-EntityHelped"
  top : "value-helping-Agent"
  top : "value-hiking-Agent"
  top : "value-hiking-Place"
  top : "value-hitchhiking-Agent"
  top : "value-hitchhiking-Place"
  top : "value-hitting-Place"
  top : "value-hitting-Tool"
  top : "value-hitting-Agent"
  top : "value-hitting-Victim"
  top : "value-hitting-VictimPart"
  top : "value-hoeing-Agent"
  top : "value-hoeing-Place"
  top : "value-hoeing-Ground"
  top : "value-hoisting-Tool"
  top : "value-hoisting-Item"
  top : "value-hoisting-Agent"
  top : "value-hoisting-Place"
  top : "value-hoisting-Source"
  top : "value-hugging-Hugged"
  top : "value-hugging-AgentPart"
  top : "value-hugging-Agent"
  top : "value-hugging-Place"
  top : "value-hunching-Surface"
  top : "value-hunching-Place"
  top : "value-hunching-Agent"
  top : "value-hunting-Place"
  top : "value-hunting-Hunted"
  top : "value-hunting-Agent"
  top : "value-hurling-Place"
  top : "value-hurling-Start"
  top : "value-hurling-End"
  top : "value-hurling-Object"
  top : "value-hurling-Agent"
  top : "value-igniting-Tool"
  top : "value-igniting-Item"
  top : "value-igniting-Agent"
  top : "value-igniting-Place"
  top : "value-ignoring-BoringThing"
  top : "value-ignoring-Place"
  top : "value-ignoring-Agent"
  top : "value-imitating-Place"
  top : "value-imitating-Model"
  top : "value-imitating-Agent"
  top : "value-immersing-Place"
  top : "value-immersing-Item"
  top : "value-immersing-Agent"
  top : "value-immersing-Liquid"
  top : "value-inflating-Object"
  top : "value-inflating-Tool"
  top : "value-inflating-Agent"
  top : "value-inflating-Place"
  top : "value-injecting-Source"
  top : "value-injecting-Destination"
  top : "value-injecting-Place"
  top : "value-injecting-Substance"
  top : "value-injecting-Agent"
  top : "value-inserting-Object"
  top : "value-inserting-Place"
  top : "value-inserting-Agent"
  top : "value-inserting-Container"
  top : "value-installing-Tool"
  top : "value-installing-Place"
  top : "value-installing-Component"
  top : "value-installing-Destination"
  top : "value-installing-Agent"
  top : "value-instructing-Student"
  top : "value-instructing-Place"
  top : "value-instructing-Agent"
  top : "value-intermingling-Agents"
  top : "value-intermingling-Place"
  top : "value-interrogating-Addressee"
  top : "value-interrogating-Tool"
  top : "value-interrogating-Agent"
  top : "value-interrogating-Place"
  top : "value-interviewing-Interviewee"
  top : "value-interviewing-Place"
  top : "value-interviewing-Agent"
  top : "value-jogging-Agent"
  top : "value-jogging-Place"
  top : "value-juggling-Place"
  top : "value-juggling-Items"
  top : "value-juggling-Agent"
  top : "value-jumping-Source"
  top : "value-jumping-Destination"
  top : "value-jumping-Place"
  top : "value-jumping-Obstacle"
  top : "value-jumping-Agent"
  top : "value-kicking-Victim"
  top : "value-kicking-Place"
  top : "value-kicking-VictimPart"
  top : "value-kicking-Agent"
  top : "value-kissing-CoAgent"
  top : "value-kissing-AgentPart"
  top : "value-kissing-CoAgentPart"
  top : "value-kissing-Place"
  top : "value-kissing-Agent"
  top : "value-kneading-Place"
  top : "value-kneading-Item"
  top : "value-kneading-Agent"
  top : "value-kneeling-Place"
  top : "value-kneeling-Contact"
  top : "value-kneeling-Agent"
  top : "value-knocking-Place"
  top : "value-knocking-Item"
  top : "value-knocking-Agent"
  top : "value-lacing-Place"
  top : "value-lacing-Item"
  top : "value-lacing-Agent"
  top : "value-landing-Place"
  top : "value-landing-Destination"
  top : "value-landing-Agent"
  top : "value-lapping-Place"
  top : "value-lapping-Food"
  top : "value-lapping-Agent"
  top : "value-lapping-Container"
  top : "value-lathering-Substance"
  top : "value-lathering-Destination"
  top : "value-lathering-Agent"
  top : "value-lathering-Place"
  top : "value-laughing-Agent"
  top : "value-laughing-Place"
  top : "value-launching-Destination"
  top : "value-launching-Item"
  top : "value-launching-Agent"
  top : "value-launching-Place"
  top : "value-launching-Source"
  top : "value-leading-Place"
  top : "value-leading-Follower"
  top : "value-leading-Agent"
  top : "value-leaking-Source"
  top : "value-leaking-Destination"
  top : "value-leaking-Place"
  top : "value-leaking-Substance"
  top : "value-leaning-Place"
  top : "value-leaning-Item"
  top : "value-leaning-Agent"
  top : "value-leaning-Against"
  top : "value-leaping-Source"
  top : "value-leaping-Destination"
  top : "value-leaping-Place"
  top : "value-leaping-Obstacle"
  top : "value-leaping-Agent"
  top : "value-lecturing-Place"
  top : "value-lecturing-Audience"
  top : "value-lecturing-Agent"
  top : "value-licking-Place"
  top : "value-licking-Item"
  top : "value-licking-Agent"
  top : "value-lifting-Place"
  top : "value-lifting-Item"
  top : "value-lifting-Agent"
  top : "value-lifting-End"
  top : "value-lifting-Start"
  top : "value-lighting-Tool"
  top : "value-lighting-Item"
  top : "value-lighting-Agent"
  top : "value-lighting-Place"
  top : "value-loading-Tool"
  top : "value-loading-Item"
  top : "value-loading-Place"
  top : "value-loading-Destination"
  top : "value-loading-Agent"
  top : "value-locking-Tool"
  top : "value-locking-Item"
  top : "value-locking-Agent"
  top : "value-locking-Place"
  top : "value-making-Tool"
  top : "value-making-Component"
  top : "value-making-Place"
  top : "value-making-GoalItem"
  top : "value-making-Agent"
  top : "value-manicuring-Tool"
  top : "value-manicuring-Item"
  top : "value-manicuring-Agent"
  top : "value-manicuring-Place"
  top : "value-marching-Agent"
  top : "value-marching-Place"
  top : "value-mashing-Tool"
  top : "value-mashing-Item"
  top : "value-mashing-Agent"
  top : "value-mashing-Place"
  top : "value-massaging-Place"
  top : "value-massaging-CoAgent"
  top : "value-massaging-Agent"
  top : "value-massaging-CoAgentPart"
  top : "value-measuring-Object"
  top : "value-measuring-Tool"
  top : "value-measuring-Agent"
  top : "value-measuring-Place"
  top : "value-measuring-Quantity"
  top : "value-mending-Tool"
  top : "value-mending-Item"
  top : "value-mending-Agent"
  top : "value-mending-Place"
  top : "value-microwaving-Place"
  top : "value-microwaving-Food"
  top : "value-microwaving-Agent"
  top : "value-microwaving-Container"
  top : "value-milking-Tool"
  top : "value-milking-Source"
  top : "value-milking-Place"
  top : "value-milking-Destination"
  top : "value-milking-Agent"
  top : "value-miming-Imitation"
  top : "value-miming-Place"
  top : "value-miming-Agent"
  top : "value-mining-Tool"
  top : "value-mining-Place"
  top : "value-mining-Agent"
  top : "value-mining-Resource"
  top : "value-misbehaving-Agent"
  top : "value-misbehaving-Place"
  top : "value-moistening-Place"
  top : "value-moistening-Item"
  top : "value-moistening-Agent"
  top : "value-moistening-Liquid"
  top : "value-moisturizing-Tool"
  top : "value-moisturizing-Place"
  top : "value-moisturizing-Agent"
  top : "value-moisturizing-Moisturized"
  top : "value-molding-Substance"
  top : "value-molding-Place"
  top : "value-molding-Agent"
  top : "value-molding-GoalItem"
  top : "value-mopping-Surface"
  top : "value-mopping-Place"
  top : "value-mopping-Agent"
  top : "value-mourning-Mourner"
  top : "value-mourning-Place"
  top : "value-mowing-Tool"
  top : "value-mowing-Item"
  top : "value-mowing-Agent"
  top : "value-mowing-Place"
  top : "value-nagging-NaggedPerson"
  top : "value-nagging-Place"
  top : "value-nagging-Agent"
  top : "value-nailing-Tool"
  top : "value-nailing-Item2"
  top : "value-nailing-Place"
  top : "value-nailing-Item1"
  top : "value-nailing-Agent"
  top : "value-nipping-Place"
  top : "value-nipping-Item"
  top : "value-nipping-Agent"
  top : "value-nuzzling-Place"
  top : "value-nuzzling-Item"
  top : "value-nuzzling-Agent"
  top : "value-offering-Item"
  top : "value-offering-Beneficiary"
  top : "value-offering-Agent"
  top : "value-offering-Place"
  top : "value-officiating-Event"
  top : "value-officiating-Place"
  top : "value-officiating-Agent"
  top : "value-opening-Tool"
  top : "value-opening-Item"
  top : "value-opening-Agent"
  top : "value-opening-Place"
  top : "value-operating-Tool"
  top : "value-operating-Item"
  top : "value-operating-Agent"
  top : "value-operating-Place"
  top : "value-overflowing-Place"
  top : "value-overflowing-Source"
  top : "value-overflowing-Agent"
  top : "value-packaging-Place"
  top : "value-packaging-Item"
  top : "value-packaging-Agent"
  top : "value-packing-Place"
  top : "value-packing-Item"
  top : "value-packing-Agent"
  top : "value-packing-Container"
  top : "value-painting-Tool"
  top : "value-painting-Item"
  top : "value-painting-Agent"
  top : "value-painting-Place"
  top : "value-panhandling-Target"
  top : "value-panhandling-Place"
  top : "value-panhandling-Agent"
  top : "value-parachuting-Destination"
  top : "value-parachuting-Parachute"
  top : "value-parachuting-Agent"
  top : "value-parachuting-Place"
  top : "value-parading-Agent"
  top : "value-parading-Place"
  top : "value-pasting-Item"
  top : "value-pasting-Connector"
  top : "value-pasting-Place"
  top : "value-pasting-Object"
  top : "value-pasting-Agent"
  top : "value-patting-Tool"
  top : "value-patting-Item"
  top : "value-patting-Agent"
  top : "value-patting-Place"
  top : "value-pawing-PawedItem"
  top : "value-pawing-AgentPart"
  top : "value-pawing-Agent"
  top : "value-pawing-Place"
  top : "value-paying-Place"
  top : "value-paying-Good"
  top : "value-paying-Seller"
  top : "value-paying-Agent"
  top : "value-pedaling-Agent"
  top : "value-pedaling-Place"
  top : "value-pedaling-Vehicle"
  top : "value-peeing-Target"
  top : "value-peeing-Place"
  top : "value-peeing-Agent"
  top : "value-peeling-Tool"
  top : "value-peeling-Item"
  top : "value-peeling-Agent"
  top : "value-peeling-Place"
  top : "value-performing-Place"
  top : "value-performing-Tool"
  top : "value-performing-Agent"
  top : "value-performing-Event"
  top : "value-performing-Stage"
  top : "value-perspiring-Agent"
  top : "value-perspiring-Place"
  top : "value-phoning-Place"
  top : "value-phoning-Tool"
  top : "value-phoning-Agent"
  top : "value-photographing-Tool"
  top : "value-photographing-Item"
  top : "value-photographing-Agent"
  top : "value-photographing-Place"
  top : "value-picking-Place"
  top : "value-picking-Source"
  top : "value-picking-Agent"
  top : "value-picking-Crop"
  top : "value-piloting-Place"
  top : "value-piloting-Start"
  top : "value-piloting-Agent"
  top : "value-piloting-End"
  top : "value-piloting-Vehicle"
  top : "value-pinching-Object"
  top : "value-pinching-Place"
  top : "value-pinching-Agent"
  top : "value-pinching-ObjectPart"
  top : "value-pinning-Destination"
  top : "value-pinning-Pinned"
  top : "value-pinning-Agent"
  top : "value-pinning-Place"
  top : "value-pitching-Place"
  top : "value-pitching-Tool"
  top : "value-pitching-Agent"
  top : "value-pitching-Pitched"
  top : "value-placing-Destination"
  top : "value-placing-PlacedItem"
  top : "value-placing-Agent"
  top : "value-placing-Place"
  top : "value-planting-Tool"
  top : "value-planting-CoParticipant"
  top : "value-planting-Place"
  top : "value-planting-Planted"
  top : "value-planting-Agent"
  top : "value-plowing-Place"
  top : "value-plowing-Instrument"
  top : "value-plowing-Agent"
  top : "value-plummeting-Destination"
  top : "value-plummeting-Start"
  top : "value-plummeting-Agent"
  top : "value-plummeting-Place"
  top : "value-plunging-Destination"
  top : "value-plunging-Place"
  top : "value-plunging-Agent"
  top : "value-plunging-Plunged"
  top : "value-poking-Tool"
  top : "value-poking-Place"
  top : "value-poking-ObjectPart"
  top : "value-poking-Object"
  top : "value-poking-Agent"
  top : "value-pooing-Place"
  top : "value-pooing-Destination"
  top : "value-pooing-Agent"
  top : "value-potting-Place"
  top : "value-potting-Item"
  top : "value-potting-Agent"
  top : "value-potting-Container"
  top : "value-pouncing-Place"
  top : "value-pouncing-Destination"
  top : "value-pouncing-Agent"
  top : "value-pouring-Tool"
  top : "value-pouring-Substance"
  top : "value-pouring-Agent"
  top : "value-pouring-Destination"
  top : "value-pouring-Place"
  top : "value-pouring-Source"
  top : "value-pouting-Agent"
  top : "value-pouting-Place"
  top : "value-practicing-Place"
  top : "value-practicing-Skill"
  top : "value-practicing-Agent"
  top : "value-practicing-Tool"
  top : "value-praying-Agent"
  top : "value-praying-Place"
  top : "value-preaching-Place"
  top : "value-preaching-Addressee"
  top : "value-preaching-Agent"
  top : "value-pressing-Place"
  top : "value-pressing-Item"
  top : "value-pressing-Agent"
  top : "value-pricking-Tool"
  top : "value-pricking-Pricked"
  top : "value-pricking-Agent"
  top : "value-pricking-Place"
  top : "value-protesting-Agent"
  top : "value-protesting-Place"
  top : "value-providing-Place"
  top : "value-providing-Item"
  top : "value-providing-Agent"
  top : "value-providing-Recipient"
  top : "value-providing-Source"
  top : "value-prowling-Target"
  top : "value-prowling-Place"
  top : "value-prowling-Agent"
  top : "value-pruning-RemovedItem"
  top : "value-pruning-Source"
  top : "value-pruning-Tool"
  top : "value-pruning-Place"
  top : "value-pruning-Agent"
  top : "value-prying-Tool"
  top : "value-prying-Item"
  top : "value-prying-Place"
  top : "value-prying-From"
  top : "value-prying-Agent"
  top : "value-puckering-Place"
  top : "value-puckering-AgentPart"
  top : "value-puckering-Agent"
  top : "value-pulling-Tool"
  top : "value-pulling-Item"
  top : "value-pulling-Agent"
  top : "value-pulling-Place"
  top : "value-pumping-Tool"
  top : "value-pumping-Substance"
  top : "value-pumping-Agent"
  top : "value-pumping-Destination"
  top : "value-pumping-Place"
  top : "value-pumping-Source"
  top : "value-punching-Place"
  top : "value-punching-BodyPart"
  top : "value-punching-Agent"
  top : "value-punching-Victim"
  top : "value-punting-Place"
  top : "value-punting-Item"
  top : "value-punting-Agent"
  top : "value-pushing-Place"
  top : "value-pushing-Item"
  top : "value-pushing-AgentPart"
  top : "value-pushing-Agent"
  top : "value-putting-Destination"
  top : "value-putting-Item"
  top : "value-putting-Agent"
  top : "value-putting-Place"
  top : "value-queuing-Agent"
  top : "value-queuing-Place"
  top : "value-racing-Agent"
  top : "value-racing-Place"
  top : "value-rafting-Agent"
  top : "value-rafting-Place"
  top : "value-raining-Place"
  top : "value-raking-Destination"
  top : "value-raking-Item"
  top : "value-raking-Agent"
  top : "value-raking-Place"
  top : "value-raking-Source"
  top : "value-ramming-Victim"
  top : "value-ramming-Place"
  top : "value-ramming-RammingItem"
  top : "value-ramming-Agent"
  top : "value-reading-Place"
  top : "value-reading-Item"
  top : "value-reading-Agent"
  top : "value-rearing-Agent"
  top : "value-rearing-Place"
  top : "value-reassuring-Place"
  top : "value-reassuring-Reassured"
  top : "value-reassuring-Agent"
  top : "value-recording-Phenomenon"
  top : "value-recording-Place"
  top : "value-recording-Agent"
  top : "value-recovering-Ailment"
  top : "value-recovering-Place"
  top : "value-recovering-Agent"
  top : "value-recuperating-Agent"
  top : "value-recuperating-Place"
  top : "value-rehabilitating-Place"
  top : "value-rehabilitating-Item"
  top : "value-rehabilitating-Agent"
  top : "value-releasing-Place"
  top : "value-releasing-ReleasedItem"
  top : "value-releasing-Agent"
  top : "value-repairing-Problem"
  top : "value-repairing-Item"
  top : "value-repairing-Tool"
  top : "value-repairing-Place"
  top : "value-repairing-Agent"
  top : "value-resting-Place"
  top : "value-resting-Item"
  top : "value-resting-Agent"
  top : "value-resting-Goal"
  top : "value-restraining-Restrained"
  top : "value-restraining-Place"
  top : "value-restraining-Agent"
  top : "value-retrieving-Object"
  top : "value-retrieving-Start"
  top : "value-retrieving-Agent"
  top : "value-retrieving-Place"
  top : "value-riding-Agent"
  top : "value-riding-Place"
  top : "value-riding-Vehicle"
  top : "value-rinsing-Object"
  top : "value-rinsing-Tool"
  top : "value-rinsing-Agent"
  top : "value-rinsing-Place"
  top : "value-rocking-Container"
  top : "value-rocking-Place"
  top : "value-rocking-Agent"
  top : "value-rocking-Rocked"
  top : "value-rotting-Container"
  top : "value-rotting-Place"
  top : "value-rotting-Agent"
  top : "value-rowing-Agent"
  top : "value-rowing-Place"
  top : "value-rowing-Vehicle"
  top : "value-rubbing-Place"
  top : "value-rubbing-Item"
  top : "value-rubbing-AgentPart"
  top : "value-rubbing-Agent"
  top : "value-running-Agent"
  top : "value-running-Place"
  top : "value-saluting-Target"
  top : "value-saluting-Place"
  top : "value-saluting-Agent"
  top : "value-saying-Adressee"
  top : "value-saying-Place"
  top : "value-saying-Agent"
  top : "value-scolding-Victim"
  top : "value-scolding-Place"
  top : "value-scolding-Agent"
  top : "value-scooping-Tool"
  top : "value-scooping-Item"
  top : "value-scooping-Agent"
  top : "value-scooping-Place"
  top : "value-scooping-Source"
  top : "value-scoring-Agent"
  top : "value-scoring-Place"
  top : "value-scraping-Place"
  top : "value-scraping-ScrapedItem"
  top : "value-scraping-Agent"
  top : "value-scraping-Tool"
  top : "value-scratching-Object"
  top : "value-scratching-Tool"
  top : "value-scratching-Agent"
  top : "value-scratching-Place"
  top : "value-scrubbing-Tool"
  top : "value-scrubbing-Item"
  top : "value-scrubbing-Agent"
  top : "value-scrubbing-Place"
  top : "value-sealing-Place"
  top : "value-sealing-Item"
  top : "value-sealing-Sealant"
  top : "value-sealing-Agent"
  top : "value-selling-Item"
  top : "value-selling-Buyer"
  top : "value-selling-Seller"
  top : "value-selling-Place"
  top : "value-serving-Place"
  top : "value-serving-Item"
  top : "value-serving-Served"
  top : "value-serving-Agent"
  top : "value-sewing-Tool"
  top : "value-sewing-Item"
  top : "value-sewing-Agent"
  top : "value-sewing-Place"
  top : "value-shaking-Tool"
  top : "value-shaking-Item"
  top : "value-shaking-Agent"
  top : "value-shaking-Place"
  top : "value-sharpening-Tool"
  top : "value-sharpening-Item"
  top : "value-sharpening-Agent"
  top : "value-sharpening-Place"
  top : "value-shaving-CoAgent"
  top : "value-shaving-Substance"
  top : "value-shaving-Place"
  top : "value-shaving-Agent"
  top : "value-shaving-Tool"
  top : "value-shaving-BodyPart"
  top : "value-shearing-Place"
  top : "value-shearing-Item"
  top : "value-shearing-Source"
  top : "value-shearing-Agent"
  top : "value-shelling-Place"
  top : "value-shelling-Object"
  top : "value-shelling-Agent"
  top : "value-shelving-Destination"
  top : "value-shelving-Item"
  top : "value-shelving-Agent"
  top : "value-shelving-Place"
  top : "value-shivering-Agent"
  top : "value-shivering-Place"
  top : "value-shooting-Firearm"
  top : "value-shooting-Target"
  top : "value-shooting-Projectile"
  top : "value-shooting-Agent"
  top : "value-shopping-Place"
  top : "value-shopping-Goods"
  top : "value-shopping-Agent"
  top : "value-shouting-Place"
  top : "value-shouting-Addressee"
  top : "value-shouting-Agent"
  top : "value-shoveling-Place"
  top : "value-shoveling-Item"
  top : "value-shoveling-Source"
  top : "value-shoveling-Agent"
  top : "value-shredding-Tool"
  top : "value-shredding-Item"
  top : "value-shredding-Agent"
  top : "value-shredding-Place"
  top : "value-shrugging-Agent"
  top : "value-shrugging-Place"
  top : "value-shushing-Target"
  top : "value-shushing-Place"
  top : "value-shushing-Agent"
  top : "value-signaling-Message"
  top : "value-signaling-Place"
  top : "value-signaling-Tool"
  top : "value-signaling-Recipient"
  top : "value-signaling-Agent"
  top : "value-signing-Place"
  top : "value-signing-Tool"
  top : "value-signing-SignedItem"
  top : "value-signing-Agent"
  top : "value-singing-Agent"
  top : "value-singing-Place"
  top : "value-sitting-Place"
  top : "value-sitting-Contact"
  top : "value-sitting-Agent"
  top : "value-skating-Agent"
  top : "value-skating-Place"
  top : "value-skating-Vehicle"
  top : "value-sketching-Material"
  top : "value-sketching-Image"
  top : "value-sketching-Tool"
  top : "value-sketching-Place"
  top : "value-sketching-Agent"
  top : "value-skidding-Agent"
  top : "value-skidding-Place"
  top : "value-skiing-Agent"
  top : "value-skiing-Place"
  top : "value-skipping-Place"
  top : "value-skipping-Obstacle"
  top : "value-skipping-Agent"
  top : "value-slapping-Place"
  top : "value-slapping-Tool"
  top : "value-slapping-Agent"
  top : "value-slapping-Victim"
  top : "value-slapping-VictimPart"
  top : "value-sleeping-Agent"
  top : "value-sleeping-Place"
  top : "value-slicing-Tool"
  top : "value-slicing-SlicedItem"
  top : "value-slicing-Agent"
  top : "value-slicing-Place"
  top : "value-sliding-Destination"
  top : "value-sliding-Slider"
  top : "value-sliding-Surface"
  top : "value-sliding-Place"
  top : "value-sliding-Agent"
  top : "value-slipping-Place"
  top : "value-slipping-Destination"
  top : "value-slipping-Agent"
  top : "value-slithering-Agent"
  top : "value-slithering-Place"
  top : "value-slouching-Place"
  top : "value-slouching-Contact"
  top : "value-slouching-Agent"
  top : "value-smashing-Tool"
  top : "value-smashing-Smashed"
  top : "value-smashing-Against"
  top : "value-smashing-Place"
  top : "value-smashing-Agent"
  top : "value-smearing-Tool"
  top : "value-smearing-Item"
  top : "value-smearing-Surface"
  top : "value-smearing-Place"
  top : "value-smearing-Agent"
  top : "value-smelling-Place"
  top : "value-smelling-Item"
  top : "value-smelling-Agent"
  top : "value-smiling-Agent"
  top : "value-smiling-Place"
  top : "value-sneezing-Agent"
  top : "value-sneezing-Place"
  top : "value-sniffing-Place"
  top : "value-sniffing-Item"
  top : "value-sniffing-Agent"
  top : "value-snowing-Place"
  top : "value-snuggling-Place"
  top : "value-snuggling-CoAgent"
  top : "value-snuggling-Agent"
  top : "value-soaking-Place"
  top : "value-soaking-Item"
  top : "value-soaking-Container"
  top : "value-soaking-Substance"
  top : "value-soaking-Agent"
  top : "value-soaring-Agent"
  top : "value-soaring-Place"
  top : "value-socializing-Place"
  top : "value-socializing-CoAgent"
  top : "value-socializing-Agent"
  top : "value-sowing-Place"
  top : "value-sowing-Tool"
  top : "value-sowing-Agent"
  top : "value-spanking-Place"
  top : "value-spanking-Tool"
  top : "value-spanking-Agent"
  top : "value-spanking-Victim"
  top : "value-speaking-Place"
  top : "value-speaking-CoAgent"
  top : "value-speaking-Agent"
  top : "value-spearing-Victim"
  top : "value-spearing-Place"
  top : "value-spearing-Agent"
  top : "value-spilling-Source"
  top : "value-spilling-Destination"
  top : "value-spilling-Place"
  top : "value-spilling-Substance"
  top : "value-spilling-Agent"
  top : "value-spinning-Material"
  top : "value-spinning-Tool"
  top : "value-spinning-Agent"
  top : "value-spinning-Place"
  top : "value-spitting-Place"
  top : "value-spitting-Item"
  top : "value-spitting-Agent"
  top : "value-spitting-Target"
  top : "value-splashing-Tool"
  top : "value-splashing-Place"
  top : "value-splashing-Substance"
  top : "value-splashing-Destination"
  top : "value-splashing-Agent"
  top : "value-spoiling-Agent"
  top : "value-spoiling-Place"
  top : "value-spraying-Source"
  top : "value-spraying-Destination"
  top : "value-spraying-Place"
  top : "value-spraying-Substance"
  top : "value-spraying-Agent"
  top : "value-spreading-Substance"
  top : "value-spreading-Tool"
  top : "value-spreading-Surface"
  top : "value-spreading-Place"
  top : "value-spreading-Agent"
  top : "value-sprinkling-Destination"
  top : "value-sprinkling-Item"
  top : "value-sprinkling-Agent"
  top : "value-sprinkling-Place"
  top : "value-sprinkling-Source"
  top : "value-sprinting-Agent"
  top : "value-sprinting-Place"
  top : "value-sprouting-Place"
  top : "value-sprouting-Sprouter"
  top : "value-spying-Place"
  top : "value-spying-Tool"
  top : "value-spying-Agent"
  top : "value-spying-Target"
  top : "value-squeezing-Tool"
  top : "value-squeezing-Item"
  top : "value-squeezing-Agent"
  top : "value-squeezing-Place"
  top : "value-squinting-Place"
  top : "value-squinting-Item"
  top : "value-squinting-Agent"
  top : "value-stacking-Place"
  top : "value-stacking-Top"
  top : "value-stacking-Bottom"
  top : "value-stacking-Agent"
  top : "value-stampeding-Agent"
  top : "value-stampeding-Place"
  top : "value-standing-Agent"
  top : "value-standing-Place"
  top : "value-stapling-Tool"
  top : "value-stapling-Item"
  top : "value-stapling-Surface"
  top : "value-stapling-Place"
  top : "value-stapling-Agent"
  top : "value-staring-Place"
  top : "value-staring-Item"
  top : "value-staring-Agent"
  top : "value-steering-Place"
  top : "value-steering-Tool"
  top : "value-steering-Vehicle"
  top : "value-steering-Agent"
  top : "value-stinging-Victim"
  top : "value-stinging-Place"
  top : "value-stinging-VictimPart"
  top : "value-stinging-Agent"
  top : "value-stirring-Tool"
  top : "value-stirring-Item"
  top : "value-stirring-Place"
  top : "value-stirring-Container"
  top : "value-stirring-Agent"
  top : "value-stitching-Place"
  top : "value-stitching-Tool"
  top : "value-stitching-Agent"
  top : "value-stitching-Fastener"
  top : "value-stooping-Agent"
  top : "value-stooping-Place"
  top : "value-storming-Place"
  top : "value-strapping-Destination"
  top : "value-strapping-Strapped"
  top : "value-strapping-Agent"
  top : "value-strapping-Place"
  top : "value-strapping-Strap"
  top : "value-stretching-Place"
  top : "value-stretching-Item"
  top : "value-stretching-Agent"
  top : "value-striking-CoAgent"
  top : "value-striking-AgentPart"
  top : "value-striking-Tool"
  top : "value-striking-Place"
  top : "value-striking-Agent"
  top : "value-stripping-RemovedItem"
  top : "value-stripping-Source"
  top : "value-stripping-Tool"
  top : "value-stripping-Place"
  top : "value-stripping-Agent"
  top : "value-stroking-Place"
  top : "value-stroking-Object"
  top : "value-stroking-Agent"
  top : "value-stroking-Part"
  top : "value-studying-Agent"
  top : "value-studying-Place"
  top : "value-stuffing-Destination"
  top : "value-stuffing-Item"
  top : "value-stuffing-Agent"
  top : "value-stuffing-Place"
  top : "value-stumbling-Place"
  top : "value-stumbling-Destination"
  top : "value-stumbling-Agent"
  top : "value-subduing-Target"
  top : "value-subduing-Place"
  top : "value-subduing-Agent"
  top : "value-submerging-Object"
  top : "value-submerging-Place"
  top : "value-submerging-Agent"
  top : "value-submerging-Substance"
  top : "value-sucking-Place"
  top : "value-sucking-Item"
  top : "value-sucking-Agent"
  top : "value-surfing-Tool"
  top : "value-surfing-Path"
  top : "value-surfing-Agent"
  top : "value-surfing-Place"
  top : "value-swarming-Place"
  top : "value-swarming-AgentType"
  top : "value-sweeping-Surface"
  top : "value-sweeping-Place"
  top : "value-sweeping-Brush"
  top : "value-sweeping-Agent"
  top : "value-swimming-Agent"
  top : "value-swimming-Place"
  top : "value-swinging-Place"
  top : "value-swinging-Carrier"
  top : "value-swinging-Agent"
  top : "value-swooping-Agent"
  top : "value-swooping-Place"
  top : "value-tackling-Victim"
  top : "value-tackling-Place"
  top : "value-tackling-Agent"
